personal/organised.org
#+PROPERTY:    header-args:emacs-lisp  :tangle yes

* Org mode Emacs configuration for Prelude

This  file is a personal configuration file for a modified version of Prelude
starter kit.

To create *.el file run:
#+BEGIN_EXAMPLE
Mx org-babel-tangle
#+END_EXAMPLE

** Configuration

   This is still work in progress.

*** Prologue

Try to generate the code that passed lint test.

And Warn The user againg editing the tangled *.el file.

#+BEGIN_SRC emacs-lisp
  ;;; code:

  ;;; WARNING! this *.el file has been generated automatically from
  ;;; a corresponding *.org file. Do not edit this *.el file, but edit
  ;;; the *.org file which will generate the *.el file upon executing
  ;;; Mx org-babel-tangle.
#+END_SRC

*** graph arrow

This section will contain definitions used by multiple sections

#+begin_src emacs-lisp
(defun insert-graph-arrow ()
  (interactive)
  (insert " -> "))
#+end_src


*** ACL2

#+BEGIN_SRC emacs-lisp
  (defun load-acl2 ()
    (interactive)
    (load "~/Documents/acl2-8.4/emacs/emacs-acl2.el")
    (setq inferior-acl2-program "~/Documents/acl2-8.4/saved_acl2"))

  (defun acl2-goodies ()
    (interactive)
    (rainbow-delimiters-mode)
    (paredit-mode)
    (setq *acl2-doc-link-color* "#aaff00")

    (let ((scriptBuf (get-buffer-create "script")))
      (set-buffer scriptBuf)
      (lisp-mode)))
#+END_SRC

**** Additional advice about setting up Emacs

This is a very old document, but it gives important clues.

http://www.cs.utexas.edu/users/moore/publications/acl2-programming-exercises1.html

One is Emacs, where the ACL2 image is run in Emacs' *shell* buffer, thereby
allowing the user to cut-and-paste between a script buffer containing an
evolving file of ACL2 commands and the Lisp execution environment in which
those commands are carried out.

***** steps

start Emacs
M-x load-acl2
you will get buffer *shell*

in *shell* do ~/Documents/acl2-8.2/saved_acl2
acl2 prompt will appear

M-x acl2 goodies

*** Basic configuration

taken from
https://emacs.stackexchange.com/a/9486/8952
#+begin_src emacs-lisp
  (defun jump-to-line-in-file ()
    "Describe me"
    (interactive)
    (let ((line (thing-at-point 'filename)))
      (let ((line-components (split-string line ":")))
        (let ((file (nth 0 line-components))
              (path (nth 1 line-components))
              (line (nth 3 line-components)))
          (message (format "line components %s > %s > %s" file path line))
          (progn
            (find-file-other-window path)
            (goto-line (string-to-number line)))))))

  (global-set-key (kbd "C-x j l") 'jump-to-line-in-file)

#+end_src

#+BEGIN_SRC emacs-lisp
  (defun double-flash-mode-line ()
    (let ((flash-sec (/ 1.0 20)))
      (invert-face 'mode-line)
      (run-with-timer flash-sec nil #'invert-face 'mode-line)
      (run-with-timer (* 2 flash-sec) nil #'invert-face 'mode-line)
      (run-with-timer (* 3 flash-sec) nil #'invert-face 'mode-line)))

  (defun go-80-word-beginning ()
    (interactive)
    (beginning-of-line)
    (forward-char 80)
    (forward-word)
    (backward-word))

  (defun cleanup-80 ()
    (interactive)
    (beginning-of-line)
    (forward-char 80)
    (forward-word)
    (backward-word)

    ;; insert new line char
    (newline-and-indent))

  (global-set-key (kbd "s-8") 'cleanup-80)

  (setq prelude-guru nil) ;; better for slime
      ;; (setq guru-warn-only t) ;; not suitable for slime

  (menu-bar-mode 1)
  (global-hl-line-mode -1)
      ;; (setq prelude-flyspell nil)
      ;;(smartparens-global-mode -1)

  (global-set-key (kbd "s-f") 'vc-git-grep)

  (prelude-require-packages '(buffer-move
                              dash
                              enh-ruby-mode
                              graphviz-dot-mode
                              helm-descbinds
                              helm-projectile
                              ido-completing-read+
                              kurecolor
                              load-theme-buffer-local
                              magit
                              mode-line-bell
                              ob-restclient
                              paredit
                              parsec
                              projectile
                              projectile-rails
                              projectile-rails
                              rails-log-mode
                              rainbow-delimiters
                              redshank
                              restclient-helm
                              rspec-mode
                              rubocop
                              ruby-hash-syntax
                              ruby-refactor
                              rvm
                              slime
                              slime-repl-ansi-color
                              string-inflection
                              switch-window
                              vterm ;needs: sudo apt install libvterm-dev cmake
                              vterm-toggle
                              use-package
                              web-mode))

  (eval-when-compile
    (require 'use-package))
      (require 'diminish)                ;; if you use :diminish
      (require 'bind-key)                ;; if you use any :bind variant

      ; (add-to-list 'load-path "/home/jacek/.emacs.d/elpa/enh-ruby-mode-20190513.254/enh-ruby-mode.el") ; must be added after any path containing old ruby-mode
  (autoload 'enh-ruby-mode "enh-ruby-mode" "Major mode for ruby files" t)

  (global-set-key (kbd "s-'") (quote ruby-toggle-string-quotes))

  (add-to-list 'auto-mode-alist '("\\.rb$" . enh-ruby-mode))
  (add-to-list 'interpreter-mode-alist '("ruby" . enh-ruby-mode))                                          ;
  (add-to-list 'auto-mode-alist
                   '("\\(?:\\.rb\\|ru\\|rake\\|thor\\|jbuilder\\|gemspec\\|podspec\\|/\\(?:Gem\\|Rake\\|Cap\\|Thor\\|Vagrant\\|Guard\\|Pod\\)file\\)\\'" . enh-ruby-mode))

      ;;; ignore rufo for now
      ;; (setq rufo-enable-format-on-save t)
      ;; (add-hook 'enh-ruby-mode-hook 'rufo-minor-mode)

  (setq org-src-fontify-natively t)

  (helm-descbinds-mode)
  (require 'load-theme-buffer-local)

      ;;; get rid of utf-8 warning in Ruby mode
  (setq ruby-insert-encoding-magic-comment nil)

      ;; magit warning silencing
  (setq magit-auto-revert-mode nil)
  (setq magit-last-seen-setup-instructions "1.4.0")

  (load "server")
   (unless (server-running-p)
   (server-start))

    ;;; TODO
    ;; (add-hook 'scheme-mode-hook (lambda () (swap-paredit)))

   (add-hook 'overwrite-mode-hook #'(lambda () (double-flash-mode-line)))

#+END_SRC

*** White space
file:~/.emacs.d-prelude/core/prelude-editor.el::193

#+begin_src emacs-lisp
  (setq whitespace-line-column 480)
#+end_src

*** Tabs

#+begin_src emacs-lisp
  (defun my/ibuffer-visit-buffers-other-tab ()
    "Open buffers marked with m in other tabs."
    (interactive)
    (mapc
     #'switch-to-buffer-other-tab
     (or (ibuffer-get-marked-buffers)
         (list (ibuffer-current-buffer)))))
#+end_src

*** PlantUML

Fancy diagram making took that has to be explored further
https://plantuml.com/

https://github.com/skuro/plantuml-mode

Just install ~plantuml-mode~

M-x plantuml-set-output-type change to png to make preview work, because svg has
parsing error

#+begin_src emacs-lisp
;;; basic plantuml config

(prelude-require-packages '(flycheck-plantuml))

(setq plantuml-jar-path "~/bin/plantuml.jar")
(setq plantuml-default-exec-mode 'jar)

;; Enable plantuml-mode for PlantUML files
(add-to-list 'auto-mode-alist '("\\.puml\\'" . plantuml-mode))

;;; integrate with org-mode
(require 'org)
(add-to-list
 'org-src-lang-modes '("plantuml" . plantuml))
#+end_src


*** String inflection

#+BEGIN_SRC emacs-lisp
  (require 'string-inflection)

  ;; default
  (global-set-key [f5] 'string-inflection-all-cycle)

  ;; for ruby
  (add-hook 'ruby-mode-hook
            '(lambda ()
               (local-set-key [f6] 'string-inflection-ruby-style-cycle)))

  (setq string-inflection-skip-backward-when-done t)
#+END_SRC

*** Graphviz

#+begin_src emacs-lisp
  (add-hook 'graphviz-dot-mode-hook
              '(lambda ()
                 (local-set-key (kbd "C-]") 'insert-graph-arrow)))
#+end_src

*** Org mode configuration

**** insert source code block
This fragment [[*graph arrow][graph arrow]] is an example of inserting text into buffer.

#+begin_src emacs-lisp
;;; org-mode source code blocks
(defun insert-named-source-block (language)
  "Insert source block with LANGUAGE string provided."
  (insert "#+begin_src ")
  (insert language)
  (insert "\n")
  (insert "#+end_src"))

(defun insert-emacs-lisp-source-block ()
  (interactive)
  (insert-named-source-block "emacs-lisp"))

(add-hook 'org-mode-hook
          '(lambda ()
             (local-set-key (kbd "s-#") 'insert-emacs-lisp-source-block)))
#+end_src

**** pdf link to page index
#+BEGIN_SRC emacs-lisp
(require 'org)
(org-add-link-type "pdf" 'org-pdf-open nil)

(defun org-pdf-open (link)
  "Where page number is 105, the link should look like:
   [[pdf:/path/to/file.pdf#105][My description.]]"
  (let* ((path+page (split-string link "#"))
         (pdf-file (car path+page))
         (page (car (cdr path+page))))
    (start-process "view-pdf" nil "evince" "--page-index" page pdf-file)))
#+END_SRC

**** link to bible verse
#+begin_src emacs-lisp
   (add-hook 'org-mode-hook
             '(lambda ()
                (local-set-key [f5] 'verse-link)))
#+end_src

