personal/organised.el
  ;;; code:

  ;;; WARNING! this *.el file has been generated automatically from
  ;;; a corresponding *.org file. Do not edit this *.el file, but edit
  ;;; the *.org file which will generate the *.el file upon executing
  ;;; Mx org-babel-tangle.

(defun insert-graph-arrow ()
  (interactive)
  (insert " -> "))

  (defun load-acl2 ()
    (interactive)
    (load "~/Documents/acl2-8.3/emacs/emacs-acl2.el")
    (setq inferior-acl2-program "~/Documents/acl2-8.3/saved_acl2"))

  (defun acl2-goodies ()
    (interactive)
    (rainbow-delimiters-mode)
    (paredit-mode)
    (setq *acl2-doc-link-color* "#aaff00")

    (let ((scriptBuf (get-buffer-create "script")))
      (set-buffer scriptBuf)
      (lisp-mode)))

  (defun double-flash-mode-line ()
        (let ((flash-sec (/ 1.0 20)))
          (invert-face 'mode-line)
          (run-with-timer flash-sec nil #'invert-face 'mode-line)
          (run-with-timer (* 2 flash-sec) nil #'invert-face 'mode-line)
          (run-with-timer (* 3 flash-sec) nil #'invert-face 'mode-line)))

  (defun go-80-word-beginning ()
    (interactive)
    (beginning-of-line)
    (forward-char 80)
    (forward-word)
    (backward-word))

  (defun cleanup-80 ()
    (interactive)
    (beginning-of-line)
    (forward-char 80)
    (forward-word)
    (backward-word)

    ;; insert new line char
    (newline-and-indent))

  (global-set-key (kbd "s-8") 'cleanup-80)

  (setq prelude-guru nil) ;; better for slime
      ;; (setq guru-warn-only t) ;; not suitable for slime

  (menu-bar-mode 1)
  (global-hl-line-mode -1)
      ;; (setq prelude-flyspell nil)
      ;;(smartparens-global-mode -1)

  (global-set-key (kbd "s-f") 'vc-git-grep)

  (prelude-require-packages '(buffer-move
                                  enh-ruby-mode
                                  graphviz-dot-mode
                                  helm-descbinds
                                  helm-projectile
                                  ido-completing-read+
                                  kurecolor
                                  load-theme-buffer-local
                                  magit
                                  mode-line-bell
                                  ob-restclient
                                  paredit
                                  projectile
                                  projectile-rails
                                  projectile-rails
                                  rails-log-mode
                                  rainbow-delimiters
                                  redshank
                                  restclient-helm
                                  rspec-mode
                                  rubocop
                                  ruby-hash-syntax
                                  ruby-refactor
                                  rvm
                                  slime
                                  slime-repl-ansi-color
                                  string-inflection
                                  switch-window
                                  vterm     ;needs: sudo apt install libvterm-dev cmake
                                  vterm-toggle
                                  web-mode))

      ; (add-to-list 'load-path "/home/jacek/.emacs.d/elpa/enh-ruby-mode-20190513.254/enh-ruby-mode.el") ; must be added after any path containing old ruby-mode
  (autoload 'enh-ruby-mode "enh-ruby-mode" "Major mode for ruby files" t)

  (global-set-key (kbd "s-'") (quote ruby-toggle-string-quotes))

  (add-to-list 'auto-mode-alist '("\\.rb$" . enh-ruby-mode))
  (add-to-list 'interpreter-mode-alist '("ruby" . enh-ruby-mode))                                          ;
  (add-to-list 'auto-mode-alist
                   '("\\(?:\\.rb\\|ru\\|rake\\|thor\\|jbuilder\\|gemspec\\|podspec\\|/\\(?:Gem\\|Rake\\|Cap\\|Thor\\|Vagrant\\|Guard\\|Pod\\)file\\)\\'" . enh-ruby-mode))

      ;;; ignore rufo for now
      ;; (setq rufo-enable-format-on-save t)
      ;; (add-hook 'enh-ruby-mode-hook 'rufo-minor-mode)

  (setq org-src-fontify-natively t)

  (helm-descbinds-mode)
  (require 'load-theme-buffer-local)

      ;;; get rid of utf-8 warning in Ruby mode
  (setq ruby-insert-encoding-magic-comment nil)

      ;; magit warning silencing
  (setq magit-auto-revert-mode nil)
  (setq magit-last-seen-setup-instructions "1.4.0")

  (load "server")
   (unless (server-running-p)
   (server-start))

    ;;; TODO
    ;; (add-hook 'scheme-mode-hook (lambda () (swap-paredit)))

   (add-hook 'overwrite-mode-hook #'(lambda () (double-flash-mode-line)))

  (defun my/ibuffer-visit-buffers-other-tab ()
    "Open buffers marked with m in other tabs."
    (interactive)
    (mapc
     #'switch-to-buffer-other-tab
     (or (ibuffer-get-marked-buffers)
         (list (ibuffer-current-buffer)))))

;;; basic plantuml config

(prelude-require-packages '(flycheck-plantuml))

(setq plantuml-jar-path "~/bin/plantuml.jar")
(setq plantuml-default-exec-mode 'jar)

;; Enable plantuml-mode for PlantUML files
(add-to-list 'auto-mode-alist '("\\.puml\\'" . plantuml-mode))

;;; integrate with org-mode
(require 'org)
(add-to-list
 'org-src-lang-modes '("plantuml" . plantuml))

  (require 'string-inflection)

  ;; default
  (global-set-key [f5] 'string-inflection-all-cycle)

  ;; for ruby
  (add-hook 'ruby-mode-hook
            '(lambda ()
               (local-set-key [f6] 'string-inflection-ruby-style-cycle)))

  (setq string-inflection-skip-backward-when-done t)

  (add-hook 'graphviz-dot-mode-hook
              '(lambda ()
                 (local-set-key (kbd "C-]") 'insert-graph-arrow)))

(require 'org)
(org-add-link-type "pdf" 'org-pdf-open nil)

(defun org-pdf-open (link)
  "Where page number is 105, the link should look like:
   [[pdf:/path/to/file.pdf#105][My description.]]"
  (let* ((path+page (split-string link "#"))
         (pdf-file (car path+page))
         (page (car (cdr path+page))))
    (start-process "view-pdf" nil "evince" "--page-index" page pdf-file)))

   (add-hook 'org-mode-hook
             '(lambda ()
                (local-set-key [f5] 'verse-link)))
