personal/organised.org
**** link to a file and line
     #+begin_src emacs-lisp
(defun my-file-line-link ()
  "Copy the buffer full path and line number into a clipboard
                 for pasting into *.org file."
  (interactive)
  (let* ((home-part (concat "/home/"
                            (user-login-name)))
         (the-link
          (let ((file-link
                 (concat "file:"
                         (let ((bfn buffer-file-name))
                           (if (string-prefix-p home-part bfn)
                               (concat "~"
                                       (substring bfn (length home-part)))
                             bfn))
                         "::"
                         (substring  (what-line) 5))))
            (if (string-match " " file-link)
                (concat "[[" file-link "]]")
              file-link))))
    (kill-new
     (message the-link))))

       ;; we had to cheat to have s-\ as a shortcut
(global-set-key (kbd (format "%s-%c" "s" 92)) 'my-file-line-link)
     #+end_src

**** md-to-org-cleanup
     We can export Freeplane mind maps to ~*.md~ file format. The we can use
     pandoc to export the files to org mode.

     ~pandoc -f markdown -t org -o ./TheFile.org ./TheFile.md~

     Now we need to clean up the file removing properties drawers

     #+begin_src emacs-lisp

       (defun md-to-org-cleanup ()
         "After we use pandoc to concert md file, we need to
                        remove PROPERTIES drawers"
         (interactive)
         (search-forward ":END:")
         (search-backward ":PROPERTIES:")
         (beginning-of-line)
         ;; we remove 3 lines
         ;; 6 because we 1 clear then 2 remove empty line
         (dotimes (n 6)
           (kill-line)))

       (global-set-key (kbd "s-9") 'md-to-org-cleanup)
     #+end_src

**** ob-restclient

An extension to restclient.el for emacs that provides org-babel support.

To get started, install ob-restclient.el and add (restclient . t) to
org-babel-load-languages:

#+BEGIN_SRC emacs-lisp
  (require 'restclient)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((restclient . t)))
#+END_SRC

**** org-roam
For the time being we will skip on org-roam, since it is buggy and seems to
disagree with magit.

***** basic config

#+begin_src emacs-lisp
  ;; Org-Roam basic configuration
  (setq org-directory (concat (getenv "HOME") "/Documents/org-roam/"))

  (use-package org-roam
    :ensure t
    :after org
    :init (setq org-roam-v2-ack t) ;; Acknowledge V2 upgrade
    :custom
    (org-roam-directory (file-truename org-directory))
    :config
    (org-roam-db-autosync-enable)
    (setq org-roam-completion-everywhere t)
    :bind (("C-c n f" . org-roam-node-find)
           ("C-c n g" . org-roam-graph)
           ("C-c n r" . org-roam-node-random)
           (:map org-mode-map
                 (("C-c n i" . org-roam-node-insert)
                  ("C-c n o" . org-id-get-create)
                  ("C-c n t" . org-roam-tag-add)
                  ("C-c n a" . org-roam-alias-add)
                  ("C-c n l" . org-roam-buffer-toggle)))))
#+end_src

*** vscode interaction

#+BEGIN_SRC emacs-lisp
  (defun open-buffer-in-vscode ()
    (interactive)

    ;; this possibly crashes emacs
    ;; (save-buffer)

    (let ((bfn (buffer-file-name)))
      (when bfn (let ((com (concatenate 'string "code " bfn)))
                  (shell-command com)))))

  (global-set-key [f9] 'open-buffer-in-vscode)
#+END_SRC

*** MacOSX specific settings

#+BEGIN_SRC emacs-lisp
  ;; Allow hash to be entered on MacOSX
  (fset 'insertPound "#")
  (global-set-key (kbd "M-3") 'insertPound)

  ;;; MacOSX style shortcuts
  (global-set-key (kbd "s-z") 'undo)
  (global-set-key (kbd "s-x") 'clipboard-kill-region)
  (global-set-key (kbd "s-c") 'clipboard-kill-ring-save)
  (global-set-key (kbd "s-v") 'clipboard-yank)

  ;;; MacOSX F keys
  (global-set-key (kbd "s-3") 'kmacro-start-macro-or-insert-counter)
  (global-set-key (kbd "s-4") 'kmacro-end-or-call-macro)
#+END_SRC

*** Shortcuts

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "s-a") 'bs-cycle-previous)
  (global-set-key (kbd "s-s") 'bs-cycle-next)

  ;;; switch-window
  (global-set-key (kbd "C-x o") 'switch-window)

#+END_SRC

*** Web mode

#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
  (setq web-mode-code-indent-offset 2)
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
  (add-hook 'web-mode-hook #'(lambda () (smartparens-mode -1)))

  ;;; insert only <% side of erb tag, autopairing wi
  (fset 'insert-rails-erb-tag [?< ?% ])
  (global-set-key (kbd "s-=") 'insert-rails-erb-tag)
#+END_SRC

*** Haskell
#+BEGIN_SRC emacs-lisp
  ;;; make sure Emacs uses stack in Haskell Projects by default
  (setq haskell-process-type 'stack-ghci)

  (add-hook 'haskell-mode-hook (lambda () (setq-local company-dabbrev-downcase nil)))

  (defun capitalize-and-join-backwards ()
    (interactive)
    (search-backward " ")
    (right-char)
    (right-char)
    (insert " ")
    (left-char)
    (left-char)
    (capitalize-word 1)
    (paredit-forward-delete)
    (left-char)
    (paredit-backward-delete))

  (global-set-key (kbd "s-2") 'capitalize-and-join-backwards)


  (add-hook 'haskell-mode-hook
              '(lambda ()
                 (local-set-key (kbd "C-]") 'insert-graph-arrow)))

  (add-hook 'haskell-interactive-mode-hook
              '(lambda ()
                 (local-set-key (kbd "C-]") 'insert-graph-arrow)))

  (add-hook 'haskell-mode-hook
            '(lambda ()
               (local-set-key (kbd "C-c C-d h") 'haskell-hoogle)))

  (add-hook 'haskell-interactive-mode-hook
            '(lambda ()
               (local-set-key (kbd "C-c C-d h") 'haskell-hoogle)))

  (add-hook 'haskell-interactive-mode-hook
            '(lambda ()
               (prelude-mode -1)
               (local-set-key (kbd "C-a") 'haskell-interactive-mode-bol)))
#+END_SRC

**** ormolu
#+begin_src emacs-lisp
  (use-package ormolu
    :ensure t
    :hook (haskell-mode . ormolu-format-on-save-mode)
    :bind
    (:map haskell-mode-map
          ("s-h" . ormolu-format-buffer)))

#+end_src

*** Lisp

**** Geiser

***** Problem explanation and fix not executed by Emacs
 Until better solution is found modify:

 #+BEGIN_EXAMPLE
 ~/.emacs.d/modules/prelude-scheme.el
 #+END_EXAMPLE

 as per my comment on:
 https://gitlab.com/jaor/geiser/issues/156#note_164897206
 to have the beginning fragment like:

 #+BEGIN_EXAMPLE
 (require 'prelude-lisp)
 (require 'geiser)
 (require 'geiser-racket)
 #+END_EXAMPLE

***** the Emacs init code
 #+BEGIN_SRC emacs-lisp
   (setq geiser-active-implementations '(scheme chezscheme racket))
   ;; (setq geiser-racket-binary "/usr/bin/racket")
 #+END_SRC

**** Clojure
 #+BEGIN_SRC emacs-lisp
   (add-to-list 'auto-mode-alist '("\\.edn\\'" . clojure-mode))

   (add-hook 'cider-repl-mode-hook
             '(lambda ()
                (local-set-key (kbd "C-c M-k") 'cider-repl-clear-buffer)))

   (add-hook 'cider-repl-mode-hook
             '(lambda ()
                (local-set-key (kbd "C-c M-a") 'cider-load-all-files)))
 #+END_SRC

**** Slime
#+BEGIN_SRC emacs-lisp
  ;;; this code has been responsible for slime version problem
  ;; (defvar slime-helper-el "~/quicklisp/slime-helper.el")
  ;; (when (file-exists-p slime-helper-el)
  ;;   (load (expand-file-name slime-helper-el)))

  (require 'slime-autoloads)

  (setq slime-contribs '(slime-fancy slime-fancy-inspector))

  (defun slime-contrib-directory ()
    (let* ((slime-folder-prefix "slime-20")
           (folder-length (length slime-folder-prefix))
           (slime-folder (car (seq-filter (lambda(x) (and (>= (length x)
                                                              folder-length)
                                                          (equal slime-folder-prefix
                                                                 (subseq x 0 folder-length))) )
                                          (directory-files "~/.emacs.d/elpa")))))
      (concat "~/.emacs.d/elpa/" slime-folder "/contrib/")))

  (setq slime-complete-symbol*-fancy t
        slime-complete-symbol-function 'slime-fuzzy-complete-symbol)


  ;;; copy last s-expression to repl
  ;;; useful for expressions like (in-package #:whatever)
  ;;; alternatively you can use C-c ~ with cursor after (in-package :some-package)
  ;;; https://www.reddit.com/r/lisp/comments/ehs12v/copying_last_expression_to_repl_in_emacsslime/
  (defun slime-copy-last-expression-to-repl (string)
    (interactive (list (slime-last-expression)))
    (slime-switch-to-output-buffer)
    (goto-char (point-max))
    (insert string))

  (global-set-key (kbd "s-e") 'slime-copy-last-expression-to-repl)
#+END_SRC

