personal/organised.el

(defun my-file-line-link ()
  "Copy the buffer full path and line number into a clipboard
                 for pasting into *.org file."
  (interactive)
  (let* ((home-part (concat "/home/"
                            (user-login-name)))
         (the-link
          (let ((file-link
                 (concat "file:"
                         (let ((bfn buffer-file-name))
                           (if (string-prefix-p home-part bfn)
                               (concat "~"
                                       (substring bfn (length home-part)))
                             bfn))
                         "::"
                         (substring  (what-line) 5))))
            (if (string-match " " file-link)
                (concat "[[" file-link "]]")
              file-link))))
    (kill-new
     (message the-link))))

       ;; we had to cheat to have s-\ as a shortcut
(global-set-key (kbd (format "%s-%c" "s" 92)) 'my-file-line-link)

       (defun md-to-org-cleanup ()
         "After we use pandoc to concert md file, we need to
                        remove PROPERTIES drawers"
         (interactive)
         (search-forward ":END:")
         (search-backward ":PROPERTIES:")
         (beginning-of-line)
         ;; we remove 3 lines
         ;; 6 because we 1 clear then 2 remove empty line
         (dotimes (n 6)
           (kill-line)))

       (global-set-key (kbd "s-9") 'md-to-org-cleanup)

  (require 'restclient)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((restclient . t)))

  (defun open-buffer-in-vscode ()
    (interactive)

    ;; this possibly crashes emacs
    ;; (save-buffer)

    (let ((bfn (buffer-file-name)))
      (when bfn (let ((com (concatenate 'string "code " bfn)))
                  (shell-command com)))))

  (global-set-key [f9] 'open-buffer-in-vscode)

  ;; Allow hash to be entered on MacOSX
  (fset 'insertPound "#")
  (global-set-key (kbd "M-3") 'insertPound)

  ;;; MacOSX style shortcuts
  (global-set-key (kbd "s-z") 'undo)
  (global-set-key (kbd "s-x") 'clipboard-kill-region)
  (global-set-key (kbd "s-c") 'clipboard-kill-ring-save)
  (global-set-key (kbd "s-v") 'clipboard-yank)

  ;;; MacOSX F keys
  (global-set-key (kbd "s-3") 'kmacro-start-macro-or-insert-counter)
  (global-set-key (kbd "s-4") 'kmacro-end-or-call-macro)

  (global-set-key (kbd "s-a") 'bs-cycle-previous)
  (global-set-key (kbd "s-s") 'bs-cycle-next)

  ;;; switch-window
  (global-set-key (kbd "C-x o") 'switch-window)

  (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
  (setq web-mode-code-indent-offset 2)
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
  (add-hook 'web-mode-hook #'(lambda () (smartparens-mode -1)))

  ;;; insert only <% side of erb tag, autopairing wi
  (fset 'insert-rails-erb-tag [?< ?% ])
  (global-set-key (kbd "s-=") 'insert-rails-erb-tag)

  ;;; make sure Emacs uses stack in Haskell Projects by default
  (setq haskell-process-type 'stack-ghci)

  (add-hook 'haskell-mode-hook (lambda () (setq-local company-dabbrev-downcase nil)))

  (defun capitalize-and-join-backwards ()
    (interactive)
    (search-backward " ")
    (right-char)
    (right-char)
    (insert " ")
    (left-char)
    (left-char)
    (capitalize-word 1)
    (paredit-forward-delete)
    (left-char)
    (paredit-backward-delete))

  (global-set-key (kbd "s-2") 'capitalize-and-join-backwards)


  (add-hook 'haskell-mode-hook
              '(lambda ()
                 (local-set-key (kbd "C-]") 'insert-graph-arrow)))

  (add-hook 'haskell-interactive-mode-hook
              '(lambda ()
                 (local-set-key (kbd "C-]") 'insert-graph-arrow)))

  (add-hook 'haskell-mode-hook
            '(lambda ()
               (local-set-key (kbd "C-c C-d h") 'haskell-hoogle)))

  (add-hook 'haskell-interactive-mode-hook
            '(lambda ()
               (local-set-key (kbd "C-c C-d h") 'haskell-hoogle)))

  (add-hook 'haskell-interactive-mode-hook
            '(lambda ()
               (prelude-mode -1)
               (local-set-key (kbd "C-a") 'haskell-interactive-mode-bol)))

   (setq geiser-active-implementations '(scheme chezscheme racket))
   ;; (setq geiser-racket-binary "/usr/bin/racket")

   (add-to-list 'auto-mode-alist '("\\.edn\\'" . clojure-mode))

   (add-hook 'cider-repl-mode-hook
             '(lambda ()
                (local-set-key (kbd "C-c M-k") 'cider-repl-clear-buffer)))

   (add-hook 'cider-repl-mode-hook
             '(lambda ()
                (local-set-key (kbd "C-c M-a") 'cider-load-all-files)))

  ;;; this code has been responsible for slime version problem
  ;; (defvar slime-helper-el "~/quicklisp/slime-helper.el")
  ;; (when (file-exists-p slime-helper-el)
  ;;   (load (expand-file-name slime-helper-el)))

  (require 'slime-autoloads)

  (setq slime-contribs '(slime-fancy slime-fancy-inspector))

  (defun slime-contrib-directory ()
    (let* ((slime-folder-prefix "slime-20")
           (folder-length (length slime-folder-prefix))
           (slime-folder (car (seq-filter (lambda(x) (and (>= (length x)
                                                              folder-length)
                                                          (equal slime-folder-prefix
                                                                 (subseq x 0 folder-length))) )
                                          (directory-files "~/.emacs.d/elpa")))))
      (concat "~/.emacs.d/elpa/" slime-folder "/contrib/")))

  (setq slime-complete-symbol*-fancy t
        slime-complete-symbol-function 'slime-fuzzy-complete-symbol)


  ;;; copy last s-expression to repl
  ;;; useful for expressions like (in-package #:whatever)
  ;;; alternatively you can use C-c ~ with cursor after (in-package :some-package)
  ;;; https://www.reddit.com/r/lisp/comments/ehs12v/copying_last_expression_to_repl_in_emacsslime/
  (defun slime-copy-last-expression-to-repl (string)
    (interactive (list (slime-last-expression)))
    (slime-switch-to-output-buffer)
    (goto-char (point-max))
    (insert string))

  (global-set-key (kbd "s-e") 'slime-copy-last-expression-to-repl)
